Repository: FlorianX/ke_search
Catalog: Resources/Private/Language/*.locallang_mod.xlf
Languages: da, ru

# mlang_tabs_tab
source: Faceted Search
da: Faceteret søgning
ru: Фасетный поиск

# mlang_labels_tabdescr
source: Manage the search index, manually start the indexer process, see what content has been indexed, clear the the index.
da: Håndtér søgeindekset, start indekseringsprocessen manuelt, se hvilket indhold der er blevet indekseret, ryd indekset.
ru: Управление поисковым индексом, ручной запуск процесса индексации, просмотр проиндексированного, очистка индекса.

# mlang_labels_tablabel
source: Faceted Search Management
da: Faceteret Søgehåndtering
ru: Управление Фасетным поиском

# title
source: Faceted Search
da: Faceteret Søgning
ru: Фасетный поиск

# function1
source: Start indexing
da: Start indeksering
ru: Запустить индексирование

# function2
source: Indexed content
da: Indekseret indhold
ru: Проиндексированное содержимое

# function3
source: Index table information
da: Indeks tabel information
ru: Информация о таблице индексов

# function4
source: Searchword statistics
da: Statistik over søgeord
ru: Статистика поиска по словам

# function5
source: Clear search index
da: Ryd søgeindeks
ru: Очистить поисковый индекс

# function6
source: Last indexing report
da: Sidste indeksering rapport
ru: Последний отчет по индексации

# select_a_page
source: Please select a page.
da: Vælg venligst en side.
ru: Выберете страницу.

# not_allowed_remove_indexer_lock
source: You are not allowed to remove the indexer lock! This is for admins only!
da: Du har ikke tilladelse til at fjerne indekseringslåsen! Dette er kun for administratorer!
ru: Вам не позволено удалить блокировку индексатора! Разрешено только администраторам!

# no_indexer_configurations
source: No indexer configurations have been found. Please create an indexer configuration record first!
da: Ingen indekseringsindstillinger blev fundet. Opret venligst en indekserings-konfiguration først!
ru: Конфигурации индексатора не найдены. Сначала создайте конфигурацию индексатора!

# index_contains
source: The index currently contains
da: Indekset indeholder i øjeblikket
ru: Индекс в настоящее время содержит

# last_indexing
source: Last indexing was done on
da: Sidste indeksering blev udført den
ru: Последняя индексация была выполнена

source: records
da: elementer
ru: записей

source: page
da: side
ru: страница

# configurations_found
source: Indexer configurations have been found:
da: Indekserings konfigurationer er fundet:
ru: Найдены конфигурации индексатора:

source: Tag too short
da: Tag for kort

# tag_too_short_message
source: The given tag "%s" is too short. A minimum length of %d is required. See extension setting "searchWordLength" for further info.
da: Det angivne tag "%s" er for kort. En minimumslængde på %d er påkrævet. Se udvidelsesindstillingen "searchWordLength" for yderligere information.

source: type
ru: тип
