Repository: FlorianX/ke_search
Catalog: Resources/Private/Language/*.locallang_searchbox.xlf
Languages: fr, ru

# pi_title
source: Searchbox
fr: Boîte de recherche
ru: Блок поиска

# pi_cachable_title
source: Cachable Searchbox
fr: Boîte de recherche accessible
ru: Кешируемый блок поиска

# pi_plus_wiz_description
source: Faceted Search: Show searchbox and filters.
fr: Recherche à facettes : Afficher la boîte de recherche et les filtres.
ru: Фасетный поиск: показать блок поиска с фильтрами.

# pi_cachable_plus_wiz_description
source: Faceted search: Show cachable searchbox and filters. Filters won't be updated by the results, but the plugin is cachable.
fr: Recherche à facettes : Afficher la boîte de recherche en cache et les filtres. Les filtres ne seront pas mis à jour par les résultats, mais le plugin est en cache.
ru: Фасетный поиск: показать кешируемый блок поиска с фильтрами. Результаты не обновляются в зависимости от установленных фильтров, зато дополнение кешируемое.

# ff.page.main
source: General
fr: Général
ru: Общее

# ff.resultPage
source: Page with result list
fr: Page avec liste de résultats
ru: Страница со списком результатов

# ff.showTextInsteadOfResults
source: Show text instead of searchresults if no filter or searchword has been given?
fr: Afficher le texte au lieu des résultats de recherche si aucun filtre ou mot de recherche n'a été donné ?
ru: Показывать текст вместо результатов поиска, если фильтр или поисковый запрос не заданы?

# ff.textForResults
source: Insert this text if no filter or searchword has been given.
fr: Insérez ce texte si aucun filtre ou mot de recherche n'a été donné.
ru: Вставить этот текст, если фильтр или поисковое слово не указано.

# ff.showNoResultsText
source: Show individual text if no results were found?
fr: Afficher le texte individuel si aucun résultat n'a été trouvé ?
ru: Вывести индивидуальный текст при отсутствии результатов поиска?

# ff.noResultsText
source: Individual text for "no results found"
fr: Texte individuel pour "aucun résultat trouvé"
ru: Индивидуальный текст для "Не найдено результатов"

# ff.countSearchPhrases
source: Count search phrases in statistic tables?
fr: Compter les phrases de recherche dans les tables statistiques?
ru: Подсчитать поисковые фразы в статистических таблицах?

# ff.cssFile
source: CSS File
fr: Fichier CSS
ru: Файл CSS

# ff.page.sorting
source: Sorting
fr: Tri
ru: Сортировка

# ff.sortByAdmin
source: Sorting for searchresults
fr: Tri des résultats de recherche
ru: Сортировка результатов поиска

# ff.sortWithoutSearchword
source: Sorting for searchresults if no searchword/filter is given
fr: Tri des résultats de recherche si aucun mot de recherche/filtre n'est donné
ru: Сортировка результатов поиска, если поисковое слово/фильтр не заданы

# ff.showSortInFrontend
source: The website visitor should be able to order the searchresults
fr: Le visiteur du site web devrait être en mesure de commander les résultats de recherche
ru: Посетитель сайта должен иметь возможность упорядочивать результаты поиска

# ff.sortByVisitor
source: Fields the website user should be able to order by
fr: Les champs que l'utilisateur du site doit pouvoir commander par
ru: Поля, по которым посетитель сайта сможет сортировать

# ff.page.view
source: General Layout
fr: Mise en page générale
ru: Общий макет

# ff.showQueryTime
source: Show time (query process duration)?
fr: Afficher l'heure (durée du processus de requête)?
ru: Показать время (продолжительность процесса запроса)?

# ff.showResultUrl
source: Show result URL?
fr: Afficher l'URL du résultat ?
ru: Показать URL результата?

# ff.renderResultUrlAsLink
source: Render result URL as link (a-Tag)?
fr: Rendre l'URL du résultat comme lien (a-Tag)?
ru: Отобразить URL результата как ссылку (a-Tag)?

# ff.showDate
source: Show date?
fr: Afficher la date ?
ru: Показать дату?

# ff.resultLinkTarget
source: Target for result link
fr: Cible du lien de résultat
ru: Цель для ссылок на результат

# ff.resultLinkTargetFiles
source: Target for result link for files
fr: Cible pour le lien de résultat pour les fichiers
ru: Цель для ссылок на результат для файлов

# ff.resultLinkTarget.I.0
source: Open in new window
fr: Ouvrir dans une nouvelle fenêtre
ru: Открыть в новом окне

# ff.resultLinkTarget.I.1
source: Open in same window
fr: Ouvrir dans la même fenêtre
ru: Открыть в том же окне

# ff.resultsNumeration
source: Number results consecutively?
fr: Nombre de résultats consécutifs?
ru: Нумеровать результаты последовательно?

# ff.templateLayout
source: Template Layout
fr: Template du module
ru: Макет шаблона

# ff.templateLayout.I.0
source: Default
fr: Langue par défaut
ru: По умолчанию

# ff.highlightSword
source: Highlight search word in result preview
fr: Mettre en surbrillance le mot de recherche dans l'aperçu du résultat
ru: Выделить поисковое слово в предпросмотре результатов

# ff.previewMode
source: Text for used for search result (preview text)
fr: Texte utilisé pour le résultat de recherche (texte de prévisualisation)
ru: Текст, используемый для результата поиска (текст предварительного просмотра)

# ff.previewMode.I.0
source: Always show the abstract if set.
fr: Toujours afficher le résumé si défini.
ru: Всегда выводить аннотацию, если она имеется.

# ff.previewMode.I.1
source: Show abstract if it contains searchword, otherwise show an excerpt from the content.
fr: Afficher le résumé s'il contient un mot de recherche, sinon afficher un extrait du contenu.
ru: Показать аннотацию, если она содержит поисковое слово, в противном случае показать отрывок из содержания.

# ff.resultChars
source: Number of characters used for the result preview text.
fr: Nombre de caractères utilisés pour le texte de l'aperçu du résultat.
ru: Количество символов для текста предварительного просмотра результата.

# ff.page.images
source: Images
ru: Изображения

# ff.showTypeIcon
source: Show result type icon?
fr: Afficher le type d'icône de résultat?
ru: Показать значок типа результата?

# ff.showFilePreview
source: Show file preview instead of result icon if possible?
fr: Afficher l'aperçu du fichier au lieu de l'icône de résultat si possible ?
ru: Показывать предварительный просмотр файла вместо значка в результатах, если это возможно?

# ff.showPageImages
source: Show page image preview instead of result icon? (Images are taken from the page properties, field "search result image".)
fr: Afficher l'aperçu de l'image de la page au lieu de l'icône de résultat? (Les images sont prises à partir des propriétés de la page, champ "image de résultat de recherche".)
ru: Показывать предварительный просмотр изображения страницы вместо значка результата? (Изображения берутся из свойств страницы, поле "изображение результата поиска").

# ff.showNewsImages
source: Show news (ext:news / ext:tt_news) image preview instead of result icon?
fr: Afficher l'aperçu de l'image (ext:news / ext:tt_news) au lieu de l'icône de résultat?
ru: Показывать предварительный просмотр изображения новостей (ext:news / ext:tt_news) вместо значка результата?

# ff.page.pagebrowser
source: Pagebrowser
fr: Navigateur de page
ru: Проводник по страницам

# ff.pagebrowserOnTop
source: Show pagebrowser on top of result list
fr: Afficher le navigateur de pages au-dessus de la liste des résultats
ru: Показать проводник по страницам над списком результатов

# ff.pagebrowserAtBottom
source: Show pagebrowser at the bottom of the result list
fr: Afficher le navigateur de pages en bas de la liste des résultats
ru: Показать проводник по страницам под списком результатов

# ff.maxPagesInPagebrowser
source: Number of pages shown in pagebrowser
fr: Nombre de pages affichées dans le navigateur
ru: Количество страниц, выводимых в проводнике

# ff.resultsPerPage
source: Results per page
fr: Résultats par page
ru: Результатов на странице

# ff.page.debug
source: Debug (Admin)
ru: Отладка (Админ)

# ff.showTags
source: Show tags?
fr: Afficher les tags ?
ru: Показать теги?

# ff.logQuery
source: Log query to log file (in var/log/)?
fr: Requête de log dans le fichier de log (dans var/log) ?
ru: Записывать запрос в лог файл (в var/log/)?

# ff.showTaggedContentOnly
source: Show tagged content only?
fr: Afficher uniquement le contenu taggé ?
ru: Показать только содержимое с тегами?

# ff.page.filter
source: Filter
fr: Filtrer
ru: Фильтр

# ff.filters
source: Shown Filters
fr: Filtres affichés
ru: Показанные фильтры

# ff.hiddenfilters
source: Hidden Filters (for use with "preselected filter options")
fr: Filtres masqués (pour utiliser avec les "options de filtre présélectionnées")
ru: Скрытые фильтры (для использования с "предварительно выбранными параметрами фильтров")

# ff.preselected_filters
source: Preselected filter options
fr: Options de filtre présélectionnées
ru: Предварительно выбранные параметры фильтра

# ff.checkFilterCondition
source: Availability check for filter options
fr: Vérification de la disponibilité des options de filtre
ru: Проверка доступности для опций фильтра

# ff.checkFilterCondition.I.0
source: Check in condition to other filters
fr: Enregistrer en état pour les autres filtres
ru: Проверка в условиях остальных фильтров

# ff.checkFilterCondition.I.1
source: no check
fr: pas de vérification
ru: без проверки

# results
source: Search results
fr: Rechercher des résultats
ru: Результаты поиска

# num_results
source: %s results:
fr: %s résultats:
ru: %s результатов:

# num_results_plain
source: results
fr: résultats
ru: результаты

source: until
fr: jusqu'à
ru: до

source: of
ru: из

source: No results found
fr: Aucun résultat trouvé
ru: Нет результатов

# no_results_refine
source: This search term is not specific enough. Please choose another.
fr: Ce terme de recherche n'est pas assez spécifique. Veuillez en choisir un autre.
ru: Неопределенный поисковый запрос. Конкретизируйте запрос.

# searchword_length_error
source: Search words under length of %d characters are not processed.
fr: Les mots de recherche d'une longueur inférieure à %d caractères ne sont pas traités.
ru: Поиск слов длиной %d символов не обрабатывается.

# error_resultPage
source: You have defined an results page in your Plugin configuration. So it makes no sense to insert resultlist plugin on to this page, too.
fr: Vous avez défini une page de résultats dans la configuration de votre plugin. Cela n'a donc aucun sens d'insérer un plugin de liste de résultats sur cette page.
ru: Вы определили страницу результатов в конфигурации вашего плагина. Поэтому не имеет смысла вставлять дополнение с результатами на эту страницу.

# error_templatePaths
source: No template paths set. Did you include the static template?
fr: Aucun chemin de template défini. Avez-vous inclus le modèle statique ?
ru: Пути к шаблонам не установлены. Включен статический шаблон?

# pagebrowser_prev
source: previous
fr: précédent
ru: назад

# pagebrowser_next
source: next
fr: suivant
ru: далее

# label_sort
source: Sorting:
fr: Tri :
ru: Сортировка:

# label_score
source: Score
ru: Оценка

# label_date
source: Date
ru: Дата

# label_tags
source: Tags
ru: Теги

# label_all
source: select all / deselect all
fr: tout sélectionner / désélectionner
ru: выбрать все / снять выбор

source: Loading
fr: Chargement
ru: Загрузка

# all_options
source: ALL
fr: TOUT
ru: ВСЕ

# message_before_search
source: Please choose your search parameters.
fr: Veuillez choisir vos paramètres de recherche.
ru: Определите параметры поиска.

# query_time
source: The search query was processed in %s ms.
fr: La requête de recherche a été traitée dans %s ms.
ru: Поисковый запрос обработан за %s мс.

# reset_button
source: Reset
fr: Réinitialiser
ru: Сброс

source: Reset filter
fr: Réinitialiser le filtre
ru: Сбросить фильтр

# submit
source: Find
fr: Trouver
ru: Найти

source: Back
fr: Retour
ru: Назад

# checkbox_submit
source: Apply filter
fr: Appliquer un filtre
ru: Применить фильтр

# orderlink_title
source: Title
fr: Titre
ru: Заголовок

# orderlink_score
source: Relevance
fr: Pertinence
ru: Релевантность

# orderlink_sortdate
source: Date
ru: Дата

# searchbox_default_value
source: Your search phrase
fr: Votre phrase de recherche
ru: Ваш поисковый запрос

# linktext_more
source: More %s and Multiselection
fr: Plus de %s et de Multisélection
ru: Еще %s и множественный выбор

source: Show results
fr: Afficher les résultats
ru: Показать результаты

# dateRange.start
source: Start
fr: Début
ru: Начало

# dateRange.end
source: End
fr: Fin
ru: Конец

# dateformat.time
source: %I:%M %p
fr: %H:%M:%S

# dateformat.dateWithYear
source: %B %e, %Y
fr: %e %B %Y

# dateformat.dateWithoutYear
source: %B %e
fr: %e %B
