Repository: FlorianX/ke_search
Catalog: Resources/Private/Language/*.locallang_dashboard.xlf
Languages: da, ru

# dashboard_preset.description
source: A dashboard with all available widgets for search.
da: Et betjeningspanel med alle tilgængelige widgets til søgning.
ru: Панель со всеми доступными для поиска виджетами.

# widgets.keSearchStatus.title
source: Indexer Status
da: Indekseringsstatus
ru: Статус индексатора

# widgets.keSearchStatus.description
source: Shows the current status of the ke_search indexer.
da: Viser den aktuelle status for ke_search indexering.
ru: Показывает текущий статус индексатора ke_search.

# widgets.keSearchStatus.running_since
source: Indexer is running since
da: Indekseringen har kørt siden
ru: Индексатор работает с

# widgets.keSearchStatus.not_running
source: Currently no indexing process is running
da: I øjeblikket kører ingen indekseringsproces
ru: На данный момент процесс индексации не запущен

# widgets.keSearchStatus.h
source: h
ru: ч

# widgets.keSearchStatus.m
source: m
ru: м

# widgets.keSearchStatus.s
source: s
ru: с

# widgets.keSearchStatus.last_run_finished
source: Last run finished
da: Sidste kørsel afsluttet
ru: Последний запуск завершен

# widgets.keSearchStatus.last_run_finished_at
source: at
da: kl.
ru: в

# widgets.keSearchStatus.last_run_took
source: and took
da: og tog
ru: и занял

# widgets.keSearchIndexOverview.title
source: Index Overview
da: Oversigt over Indeks
ru: Обзор индекса

# widgets.keSearchIndexOverview.chart.dataSet.0
source: Number of records
da: Antal elementer
ru: Количество записей

# widgets.keSearchIndexOverview.description
source: Shows how many records of each type are currently in the index.
da: Viser hvor mange elementer af hver type der er i indekset.
ru: Количество записей каждого типа в индексе на данный момент.

# widgets.keSearchTrendingSearchphrases.title
source: Trending search phrases
da: Populære søgesætninger
ru: Популярные поисковые выражения

# widgets.keSearchTrendingSearchphrases.description
source: Shows search phrases from the last 7 days.
da: Viser søgesætninger fra de sidste 7 dage.
ru: Показывает поисковые фразы за последние 7 дней.

# widgets.keSearchTrendingSearchphrases.phrase
source: Search phrase
da: Søgesætning
ru: Поисковая фраза

# widgets.keSearchTrendingSearchphrases.number_of_usages
source: Number of usages
da: Antal anvendelser
ru: Использовалось

# widgets.keSearchTrendingSearchphrases.language
source: Language
da: Sprog
ru: Язык

# error_templatePaths
source: No template paths set. Did you include the static template?
da: Ingen skabelonstier angivet. Har du inkluderet den statiske skabelon?
ru: Пути к шаблонам не установлены. Включен статический шаблон?
