Repository: FlorianX/ke_search
Catalog: Resources/Private/Language/*.locallang_db.xlf
Languages: da

# pages.tx_kesearch_label
source: Search
da: Søg

# pages.tx_kesearch_tags
source: Tags for faceted search
da: Tags for facetteret søgning

# pages.tx_kesearch_resultimage
source: Search result image
da: Billede til søgeresultat

# pages.tx_kesearch_abstract
source: Abstract for search result
da: Resumé for søgeresultat

# sys_file_metadata.tx_kesearch_label
source: Search
da: Søg

# sys_file_metadata.tx_kesearch_no_search
source: Include in search
da: Inkludér i søgning

# sys_category.tx_kesearch_filter
source: Category acts as a filter option for these filters
da: Kategori fungerer som et filter mulighed for disse filtre

# sys_category.tx_kesearch_filtersubcat
source: Sub-Categories act as a filter options for these filters
da: Underkategorier fungerer som et filter indstillinger for disse filtre

# tt_content.list_type_pi1
source: Faceted search - Searchbox and Filters
da: Faceteret søgning - Søgefelt og filtre

# tt_content.list_type_pi2
source: Faceted search - Results
da: Faceteret søgning - Resultater

# tt_content.list_type_pi3
source: Faceted search - Cachable Searchbox and filters
da: Faceteret søgning - Søgefelt med cache og filtre

# tx_kesearch_filters
source: Filters
da: Filtre

# tx_kesearch_filters.title
source: Title
da: Titel

# tx_kesearch_filters.rendertype
source: Rendering type
da: Renderingstype

# tx_kesearch_filters.markAllCheckboxes
source: Mark all checkboxes by default?
da: Markér som standard alle afkrydsningsfelter?

# tx_kesearch_filters.options
source: Filter options
da: Filtreringsindstillinger

# tx_kesearch_filters.target_pid
source: Choose page where to show all filter options
da: Vælg side, hvor alle filterindstillinger skal vises

# tx_kesearch_filters.amount
source: How many textlinks should be displayed?
da: Hvor mange tekstlinks skal vises?

# tx_kesearch_filters.shownumberofresults
source: Show number of results for each filter option?
da: Vis antal resultater for hver filterindstilling?

# tx_kesearch_filters.alphabeticalsorting
source: Sort filteroptions alphabetically?
da: Sortér filtermuligheder alfabetisk?

# tx_kesearch_filters.rendertype.I.0
source: Select/Dropdown
da: Vælg/Dropdown

# tx_kesearch_filters.rendertype.I.1
source: List/Textlinks
da: Liste/Tekstlinks

# tx_kesearch_filters.rendertype.I.2
source: Checkboxes (multiselection OR)
da: Afkrydsningsfelter (multiselection OR)

# tx_kesearch_filters.rendertype.I.3
source: Date range
da: Datointerval

# tx_kesearch_filteroptions
source: Filter options
da: Filtreringsindstillinger

# tx_kesearch_filteroptions.title
source: Title
da: Titel

# tx_kesearch_filteroptions.automated_tagging
source: Set tag for this page and all children
da: Sæt tag for denne side og alle underordnede

# tx_kesearch_filteroptions.automated_tagging_exclude
source: Exclude tag for all children of this page
da: Udeluk tag for alle underordnede på denne side

# tx_kesearch_index
source: Index
da: Indeks

# tx_kesearch_index.relevance
source: Relevance
da: Relevans

# tx_kesearch_index.targetpid
source: Target PID
da: Destinationsside

# tx_kesearch_index.content
source: Indexed content
da: Indekseret indhold

# tx_kesearch_index.hidden_content
source: Indexed hidden content
da: Indekseret skjult indhold

# tx_kesearch_index.hidden_content.description
source: Will be searched but not shown in the frontend
da: Vil blive fremsøgt men ikke vist i frontend

# tx_kesearch_index.params
source: Parameters
da: Parametre

# tx_kesearch_index.abstract
source: Abstract
da: Resumé

# tx_kesearch_index.title
source: Title
da: Titel

# tx_kesearch_index.language
source: Language UID
da: Sprog UID

# tx_kesearch_index.sortdate
source: Date
da: Dato

# tx_kesearch_index.directory
source: Directory
da: Mappe

# tx_kesearch_indexerconfig
source: Indexer Configuration
da: Indekseringsopsætning

# tx_kesearch_indexerconfig.tabs.advanced
source: Advanced
da: Avanceret

# tx_kesearch_indexerconfig.title
source: Title
da: Titel

# tx_kesearch_indexerconfig.storagepid
source: Storage
da: Lager

# tx_kesearch_indexerconfig.storagepid.description
source: Storage page for search data (the index)
da: Lagerside for søgedata (indekset)

# tx_kesearch_indexerconfig.targetpid
source: Target page for extension content
da: Målside for udvidelsesindhold

# tx_kesearch_indexerconfig.startingpoints_recursive
source: Pages/folders recursive
da: Sider/mapper rekursive

# tx_kesearch_indexerconfig.startingpoints_recursive.description
source: Pages/folders and sub-pages/sub-folders to be indexed (recursive)
da: Sider/mapper og undersider/undermapper, der skal indekseres (rekursive)

# tx_kesearch_indexerconfig.single_pages
source: Single pages
da: Enkelt sider

# tx_kesearch_indexerconfig.single_pages.description
source: Pages to be indexed (non-recursive)
da: Sider, der skal indekseres (ikke rekursive)

# tx_kesearch_indexerconfig.sysfolder
source: Single folders
da: Enkelt mapper

# tx_kesearch_indexerconfig.sysfolder.description
source: Folders to be indexed (non-recursive)
da: Sider, der skal indekseres (ikke rekursive)

# tx_kesearch_indexerconfig.type.I.0
source: Pages
da: Sider

# tx_kesearch_indexerconfig.type.I.2
source: News (tt_news)
da: Nyheder (tt_news)

# tx_kesearch_indexerconfig.type.I.5
source: Address records (tt_address)
da: Adresseposter (tt_address)

# tx_kesearch_indexerconfig.type.I.6
source: Content records (tt_content)
da: Indholdselementer (tt_content)

# tx_kesearch_indexerconfig.type.I.7
source: Files
da: Filer

# tx_kesearch_indexerconfig.type.I.12
source: News (news)
da: Nyheder (news)

# tx_kesearch_indexerconfig.index_content_with_restrictions
source: Index content elements with restrictions?
da: Indeksér indholdselementer med begrænsninger?

# tx_kesearch_indexerconfig.index_content_with_restrictions.description
source: Content elements will be indexed even if they have frontend user group access restrictions. This function may be used to "tease" content elements and then tell the user that a login is needed.
da: Indholdselementer vil blive indekseret, selvom de har frontend brugergruppe adgang begrænsninger. Denne funktion kan bruges til at "tease" indholdselementer og derefter fortælle brugeren, at et login er nødvendigt.

# tx_kesearch_indexerconfig.index_content_with_restrictions.I.0
source: Yes
da: Ja

# tx_kesearch_indexerconfig.index_content_with_restrictions.I.1
source: No
da: Nej

# tx_kesearch_indexerconfig.index_news_category_mode
source: Category mode
da: Kategoritilstand

# tx_kesearch_indexerconfig.index_news_category_mode.I.1
source: Index all news records
da: Indeksér alle nyhedselementer

# tx_kesearch_indexerconfig.index_news_category_mode.I.2
source: Index only news with selected categories
da: Indeksér kun nyheder med udvalgte kategorier

# tx_kesearch_indexerconfig.index_news_archived
source: Archived news settings
da: Indstillinger for arkiverede nyheder

# tx_kesearch_indexerconfig.index_news_archived.I.0
source: Index all news
da: Indeksér alle nyheder

# tx_kesearch_indexerconfig.index_news_archived.I.1
source: Index only active news
da: Indeksér kun aktive nyheder

# tx_kesearch_indexerconfig.index_news_archived.I.2
source: Index only archived news
da: Indeksér kun arkiverede nyheder

# tx_kesearch_indexerconfig.index_news_category_selection
source: Categories
da: Kategorier

# tx_kesearch_indexerconfig.index_news_useHRDatesSingleWithoutDay
source: Use dates without day for single-view-URLs
da: Brug datoer uden dag til enkelt-view-URL'er

# tx_kesearch_indexerconfig.index_news_files_mode
source: Attached files should be handled as
da: Vedhæftede filer skal håndteres som

# tx_kesearch_indexerconfig.index_news_files_mode.I.0
source: Separate search result
da: Separer søgeresultater

# tx_kesearch_indexerconfig.index_news_files_mode.I.1
source: Content of news record
da: Indhold af nyhedselementer

# tx_kesearch_indexerconfig.index_extnews_category_selection
source: Categories
da: Kategorier

# tx_kesearch_indexerconfig.index_use_page_tags
source: Add tags of parent pages/folders?
da: Tilføj tags af overordnede sider/mapper?

# tx_kesearch_indexerconfig.index_use_page_tags_for_files
source: Add tags to files also?
da: Føj tags også til filer?

# tx_kesearch_indexerconfig.index_page_doctypes
source: Page types which should be indexed
da: Side typer som skal indekseres

# tx_kesearch_indexerconfig.index_page_doctypes.description
source: Refers to the field "doktype" in the "pages" table, default: 1
da: Henviser til feltet "doktype" i tabellen "sider", standard: 1

# tx_kesearch_indexerconfig.directories
source: Directories
da: Mapper

# tx_kesearch_indexerconfig.directories.description
source: comma-separated, if FAL is used, name the directories as inside the file storage, e.g.: 'my_directory/,my_other_directory/'. If FAL is not used, you need to add the storage folder, e.g.: 'fileadmin/user_upload/,fileadmin/examples/'
da: komma-separeret, hvis FAL er anvendt, navngiv mapperne ligesom i filelageret, f.eks.: 'my_directory/,my_other_directory/'. Hvis FAL ikke bruges, skal du tilføje lagringsmappen, f.eks.: 'fileadmin/user_upload/,fileadmin/examples/'

# tx_kesearch_indexerconfig.fileext
source: File indexer: Comma separated list of allowed file extensions (eg. pdf,ppt,doc,xls)
da: File indexer: Kommasepareret liste over tilladte filtypenavne (f.eks. pdf, ppt,doc, xls)

# tx_kesearch_indexerconfig.contenttypes
source: Content element types which should be indexed
da: Indholdselementtyper som skal indekseres

# tx_kesearch_indexerconfig.contenttypes.description
source: Refers to field "CType" in the "tt_content" table, default: text,textpic,bullets,table,html,header,uploads,shortcut
da: Henviser til feltet "CType" i tabellen "tt_content", standard: text,textpic,bullets,table,html,header,uploads,shortcut

# tx_kesearch_indexerconfig.file_reference_fields
source: tt_content fields which should be indexed for file references
da: tt_content felter som skal indekseres til fil referencer

# tx_kesearch_indexerconfig.file_reference_fields.description
source: default: media
da: standard: medie

# tx_kesearch_indexerconfig.content_fields
source: tt_content fields which should be indexed
da: tt_content felter som skal indekseres

# tx_kesearch_indexerconfig.filteroption
source: Add tag to all indexed elements
da: Tilføj tag til alle indekserede elementer

# tx_kesearch_indexerconfig.fal_storage
source: File storage (FAL)
da: Fil lager (FAL)

# tx_kesearch_indexerconfig.fal_storage.dont_use_fal
source: Dont' use FAL but read files directly
da: Brug ikke FAL, men læs filer direkte
